'''
Создать три переменные, содержащие возраст трех ваших друзей, в качестве имен переменных использовать имена друзей,
найти сумму и вывести ее на экран.
'''

nikita_age = 20
danik_age = 19
sasha_age = 26

print(nikita_age + danik_age + sasha_age)