'''
Создать еще одну переменную равную среднему арифметическому возрасту, и вывести это значение на экран.
'''

nikita_age = 20
danik_age = 19
sasha_age = 26
average = (nikita_age + danik_age + sasha_age) / 3

print(average)