'''
Создать список состоящий из отдельных единичных символов, преобразовать список в строку, инвертировать
строку и вывести на печать.
'''

list = ['a', 'b', 'c', 'd']

print(list[::-1])